<template>
  <div class="proposal">
    <h1>提案事項</h1>
    <p>
      こちらは議論段階の内容を記載する場所です。採用された内容は適正な場所へと移動されます。（移動し、このページ内からは適宜削除してください）
    </p>
    <h2>2021.08.24 namima</h2>
    <ul>
      <li>
        <strong>インデント規則</strong> - HTML, css, javascript, PHP
        の全てにおいてインデント文字は半角スペース4文字として統一すべき...？<br />
        タブスペースは論外であると思うが、スペース2文字派とスペース4文字派が混在しており、各々の作業環境で
        linter を実行する際にストレス要素になっている気がする
      </li>
      <li>
        <strong>Headings</strong> - HTML の main 内の見出し段階について、h1
        から始めるべきか h2 から始めるべきか<br />
        半分宗教的な要素で、h1 はページに1つであり main
        内の見出しには用いないという見解が多い気がする<br />
        しかしながら、現状 Google
        のクローラーはタグによる順位付の優先度は低く、また公式にも複数回利用が問題ないという見解が出されている<br />
        個人的には CMS を用いることを想定した場合、 Gutenberg も tinyMCE
        もビジュアルエディタにおいて見出し要素の1段階目は h1 から始まる為、h2
        から始めていると操作として使いづらいものになってしまうため、 h1
        から始めるべきではないかと思っている
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'Proposal',
}
</script>
